<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DataBaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::unprepared('
insert into table_entities (id, company_name, director, phone, address) values 
(1, "ООО `Альянс`", "Иванов Иван Иванович", "+79271111111", "г. Москва, ул. Ленина, д. 23"),
(2, "ООО `Вектор`", "Петров Петр Петрович", "+79272222222", "г. Москва, ул. Пушкина, д. 45"),
(3, "ООО `Феникс`", "Сидоров Сидр Сидорович", "+79273333333", "г. Москва, ул. Толстого, д. 67"),
(4, "ООО `Орион`", "Григорьев Григорий Григорьевич", "+79274444444", "г. Москва, ул. Есенина, д. 89"),
(5, "ООО `Лидер`", "Денисов Денис Денисович", "+79275555555", "г. Москва, ул. Коммунистическая, д. 13"),
(6, "ООО `Партнер`", "Александров Александр Александрович", "+79276666666", "г. Москва, ул. Транспортная, д. 24"),
(7, "ООО `Спектр`", "Никитин Никита Никитович", "+79277777777", "г. Москва, ул. Кутузова, д. 35"),
(8, "ООО `Прогресс`", "Викторов Виктор Викторович", "+79278888888", "г. Москва, ул. Октябрьская, д. 46"),
(9, "ООО `Авангард`", "Дмитриев Дмитрий Дмитриевич", "+79279999999", "г. Москва, ул. Строительная, д. 57"),
(10, "ООО `Виктория`", "Сергеев Сергей Сергеевич", "+79271212121", "г. Москва, ул. Рабочая, д. 68");
        ');
    }
}
